# YOLO11 with CBAM attention in FPN neck
# Modification: Add CBAM (Channel+Spatial Attention) after P3 and P4 neck merge points
# Motivation: B2/B3 palm oil disambiguation requires fine-grained channel+spatial attention
# CBAM forces the model to weight ripeness-relevant color channels and spatial patterns

# Parameters
nc: 80
scales: # same as yolo11.yaml
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone (unchanged from yolo11.yaml)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]        # 9
  - [-1, 2, C2PSA, [1024]]          # 10 — PSA attention on P5 (already in base YOLO11)

# Modified neck: CBAM attention added after P3 and P4 feature merges
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11: upsample P5
  - [[-1, 6], 1, Concat, [1]]                    # 12: cat backbone P4 (layer 6)
  - [-1, 2, C3k2, [512, False]]                  # 13: merged P4 features
  - [-1, 1, CBAM, [512]]                         # 14: CBAM on P4 — NEW (channel+spatial attn)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15: upsample P4
  - [[-1, 4], 1, Concat, [1]]                    # 16: cat backbone P3 (layer 4)
  - [-1, 2, C3k2, [256, False]]                  # 17: merged P3 features
  - [-1, 1, CBAM, [256]]                         # 18: CBAM on P3 — NEW; P3 detect output

  - [-1, 1, Conv, [256, 3, 2]]                   # 19: downsample P3→P4
  - [[-1, 14], 1, Concat, [1]]                   # 20: cat CBAM-P4 features (layer 14, not 13)
  - [-1, 2, C3k2, [512, False]]                  # 21: P4 detect output

  - [-1, 1, Conv, [512, 3, 2]]                   # 22: downsample P4→P5
  - [[-1, 10], 1, Concat, [1]]                   # 23: cat backbone P5 (layer 10, C2PSA)
  - [-1, 2, C3k2, [1024, True]]                  # 24: P5 detect output

  - [[18, 21, 24], 1, Detect, [nc]]              # Detect(P3-CBAM, P4, P5)
