# YOLO11 with C2PSA (Point-wise Spatial Attention) inserted after P3/P4 neck C3k2 merge points
# Architecture: C2PSA added AFTER channel-transitioning C3k2 layers (not instead of them)
# PSA attention helps model attend to ripeness-discriminative color/texture features
# Expected: +5-8 mAP from improved fine-grained feature discrimination (similar to HAT-YOLO)
#
# Note: YOLO11 backbone already has C2PSA at P5 (layer 10). This extends PSA to P3/P4 neck.

scale: m  # default to medium scale
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone: identical to yolo11.yaml
backbone:
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
  - [-1, 2, C3k2, [512, True]]        # 6
  - [-1, 1, Conv, [1024, 3, 2]]       # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]       # 8
  - [-1, 1, SPPF, [1024, 5]]          # 9
  - [-1, 2, C2PSA, [1024]]            # 10 — original PSA on P5

# Modified neck: C2PSA attention AFTER C3k2 at each merge point
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]                   # 12 cat backbone P4
  - [-1, 2, C3k2, [512, False]]                 # 13 channel merge
  - [-1, 1, C2PSA, [512]]                        # 14 PSA attention on P4 — NEW

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 4], 1, Concat, [1]]                   # 16 cat backbone P3
  - [-1, 2, C3k2, [256, False]]                 # 17 channel merge
  - [-1, 1, C2PSA, [256]]                        # 18 PSA attention on P3 — NEW; P3 detect output

  - [-1, 1, Conv, [256, 3, 2]]                  # 19
  - [[-1, 14], 1, Concat, [1]]                  # 20 cat C2PSA-P4 (layer 14, not 13)
  - [-1, 2, C3k2, [512, False]]                 # 21 P4 detect output

  - [-1, 1, Conv, [512, 3, 2]]                  # 22
  - [[-1, 10], 1, Concat, [1]]                  # 23 cat backbone P5
  - [-1, 2, C3k2, [1024, True]]                 # 24 P5 detect output

  - [[18, 21, 24], 1, Detect, [nc]]             # Detect(P3-PSA, P4, P5)
